USE Samsonik

CREATE TABLE GROUPS
(
	IDGR int primary key identity(1,1),
	FACLT nvarchar(20) not null,
	PROF nvarchar(50) default NULL,
	YEARP int 
);
insert into GROUPS   (FACLT,  PROF, YEARP)
         values ('ИТ','1-40 01 02', 2013), 
                ('ИТ','1-40 01 02', 2012),
                ('ИТ','1-40 01 02', 2011),
                ('ИТ','1-40 01 02', 2010),
                ('ИТ','1-47 01 01', 2013),
                ('ИТ','1-47 01 01', 2012),
                ('ИТ','1-47 01 01', 2011),
                ('ИДиП','1-36 06 01', 2010),
                ('ИДиП','1-36 06 01', 2013),
                ('ИДиП','1-36 06 01', 2012),
                ('ИДиП','1-36 06 01', 2011),
                ('ХТиТ','1-36 01 08', 2013),                                                 
                ('ХТиТ','1-36 01 08', 2012),
                ('ХТиТ','1-36 07 01', 2011),
                ('ХТиТ','1-36 07 01', 2010)

CREATE TABLE STUD
(
	IDST int primary key identity(1,1),
	IDGR int foreign key references GROUPS(IDGR),
	NAME nvarchar(50),
	BDAY date
);
insert into STUD (IDGR, NAME, BDAY)
    values (5, 'Силюк Валерия Ивановна',         '12.07.1994'),
           (5, 'Сергель Виолетта Николаевна',    '06.03.1994'),
           (5, 'Добродей Ольга Анатольевна',     '09.11.1994'),
           (5, 'Подоляк Мария Сергеевна',        '04.10.1994'),
           (5, 'Никитенко Екатерина Дмитриевна', '08.01.1994'),
           (6, 'Яцкевич Галина Иосифовна',       '02.08.1993'),
           (6, 'Осадчая Эла Васильевна',         '07.12.1993'),
           (6, 'Акулова Елена Геннадьевна',      '02.12.1993'),
           (7, 'Плешкун Милана Анатольевна',     '08.03.1992'),
           (7, 'Буянова Мария Александровна',    '02.06.1992'),
           (7, 'Харченко Елена Геннадьевна',     '11.12.1992'),
           (7, 'Крученок Евгений Александрович', '11.05.1992'),
           (7, 'Бороховский Виталий Петрович',   '09.11.1992'),
           (7, 'Мацкевич Надежда Валерьевна',    '01.11.1992'),
           (8, 'Логинова Мария Вячеславовна',    '08.07.1995'),
           (8, 'Белько Наталья Николаевна',      '02.11.1995'),
           (8, 'Селило Екатерина Геннадьевна',   '07.05.1995'),
           (8, 'Дрозд Анастасия Андреевна',      '04.08.1995'),
           (9, 'Козловская Елена Евгеньевна',    '08.11.1994'),
           (9, 'Потапнин Кирилл Олегович',       '02.03.1994'),
           (9, 'Равковская Ольга Николаевна',    '04.06.1994'),
           (9, 'Ходоронок Александра Вадимовна', '09.11.1994'),
           (9, 'Рамук Владислав Юрьевич',        '04.07.1994'),
           (9, 'Неруганенок Мария Владимировна', '03.01.1993'),
           (9, 'Цыганок Анна Петровна',          '12.09.1993'),
           (9, 'Масилевич Оксана Игоревна',      '12.06.1993'),
           (9, 'Алексиевич Елизавета Викторовна','09.02.1993'),
           (9, 'Ватолин Максим Андреевич',       '04.07.1993'),
           (10, 'Синица Валерия Андреевна',       '08.01.1992'),
           (10, 'Кудряшова Алина Николаевна',     '12.05.1992'),
           (10, 'Мигулина Елена Леонидовна',      '08.11.1992'),
           (10, 'Шпиленя Алексей Сергеевич',      '12.03.1992'),
           (11, 'Астафьев Игорь Александрович',   '10.08.1995'),
           (11, 'Гайтюкевич Андрей Игоревич',     '02.05.1995'),
           (11, 'Рученя Наталья Александровна',   '08.01.1995'),
           (11, 'Тарасевич Анастасия Ивановна',   '11.09.1995'),
           (12, 'Жоглин Николай Владимирович',   '08.01.1994'),
           (12, 'Санько Андрей Дмитриевич',      '11.09.1994'),
           (12, 'Пещур Анна Александровна',      '06.04.1994'),
           (12, 'Бучалис Никита Леонидович',     '12.08.1994')


CREATE TABLE SESSIA
( IDST int foreign key references STUD(IDST),
  SUBJ nvarchar(50),
  PDATE date,
  NOTE int check(NOTE>0)	
);
insert into SESSIA(IDST,  SUBJ, PDATE, NOTE)
         values (1,'ОАП','2021-05-12', 2), 
                (2,'ОАП', '2021-05-12',6),
                (3,'ОАП', '2021-05-12',5),
                (4,'ОАП','2021-05-12', 4),
                (5,'ОАП', '2021-05-12',8),
                (6,'ОАП','2021-05-12', 10),
                (7,'ОАП', '2021-05-12',8),
                (8,'БД', '2021-05-08',4),
                (9,'БД','2021-05-08', 6),
                (10,'БД','2021-05-08', 7),
                (12,'БД', '2021-05-08',5),
                (13,'БД', '2021-05-08',3),                                                 
                (14,'БД', '2021-05-08',7),
                (15,'БД', '2021-05-08',6),
                (16,'БД', '2021-05-08',5)

SELECT g.PROF[СПЕЦИАЛЬНОСТЬ], SESSIA.SUBJ[ДИСЦИПЛИНА], STUD.NAME[ИМЯ], g.IDGR[группа],SESSIA.NOTE[оценка]
FROM STUD inner join SESSIA ON SESSIA.IDST = STUD.IDST inner join GROUPS g on   STUD.IDGR =g.IDGR
WHERE g.FACLT = 'ИТ';

SELECT  g.FACLT[Факультет], 
		g.PROF[Специальность], 
		g.YEARP[Год поступления],
		round(avg(cast(p.NOTE as float(4))),2)[Средняя оценка]
	FROM GROUPS g 
	Inner Join STUD s ON g.IDGR= s.IDGR
	Inner Join SESSIA p ON p.IDST = s.IDST
	WHERE g.FACLT IN('ИТ')
	GROUP BY g.FACLT, g.PROF, g.YEARP


UNION ALL

SELECT  g.FACLT[Факультет], 
		g.PROF[Специальность], 
		g.YEARP[Год поступления],
		round(avg(cast(p.NOTE as float(4))),2)[Средняя оценка]
	FROM GROUPS g 
	Inner Join STUD s ON g.IDGR= s.IDGR
	Inner Join SESSIA p ON p.IDST = s.IDST
	WHERE g.FACLT IN('ИДиП')
	GROUP BY g.FACLT, g.PROF, g.YEARP
